Обработки/Reports/_ОтчетОСоставеИРазмереНеобходимыхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОСоставеИРазмереНеобходимыхРасходов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НакопительныйИтог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВсеДоговорыСУстановленнымПроцентомРасходов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОСоставеИРазмереНеобходимыхРасходов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Элементы.ОрганизацияПараметр.Видимость	= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.Организация.Видимость			= Не Элементы.ОрганизацияПараметр.Видимость;
	
	Отчет.Организация			= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.Период.ДатаНачала		= НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания	= КонецМесяца(Отчет.Период.ДатаНачала);
		
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Отчет.Период.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета) 
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета") 
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
		
		ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.НастройкиОтчета.ВариантОтчета;
		
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЭтаФорма.НастройкиОтчета) и ЗначениеЗаполнено(ЭтаФорма.НастройкиОтчета.Подписант) Тогда
		
		Подписант =  ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") Тогда
		ЭтаФорма.ВариантМодифицирован = Ложь;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	Если ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		// Проверим подписанта
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ЭтаФорма.Подписант, Отчет.Организация);
		Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Тогда
			ЭтаФорма.Подписант = Неопределено;
			Возврат;
		КонецЕсли;
				
		Отчет.Подписант = СтруктураДанныхКонтактногоЛица;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
	РаботаСОтчетамиКлиентСервер.ЗаполнитьДополнительныеСвойстваВариантаОтчета(ЭтаФорма.Отчет, ЭтаФорма.КлючТекущегоВарианта);
		
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(Отчет);	
	Если ВариантОтчета = "НачисленныеИОплаченныеРасходы" Тогда	
		Отчет.НакопительныйИтог = Ложь;	
	КонецЕсли;
	
	Отчет.ВыводитьВсеДоговорыСУстановленнымПроцентомРасходов = ВариантОтчета = "Сводный";
	
	РежимПоВидуДоговора = Элементы.РежимОтбора.СписокВыбора.НайтиПоЗначению(2);
		
	Если РежимПоВидуДоговора = Неопределено И Отчет.РежимОтбора = 2 Тогда
		Отчет.РежимОтбора = 0;
	КонецЕсли;
	
	Если ВариантОтчета = "ПоКлиентуИВидуДоговораВЦелом" Или ВариантОтчета = "Сводный" Тогда
		Отчет.РежимОтбора = 1;
	КонецЕсли;	
			
	Если ВариантОтчета = "СРОиЦК" И РежимПоВидуДоговора = Неопределено Тогда
		// Для этого варианта добавлен режим "По виду договора"
		Элементы.РежимОтбора.СписокВыбора.Добавить(2, "По виду договора");
	ИначеЕсли ВариантОтчета <> "СРОиЦК" И РежимПоВидуДоговора <> Неопределено Тогда
		Элементы.РежимОтбора.СписокВыбора.Удалить(РежимПоВидуДоговора);		
		Отчет.РежимОтбора = ?(ЭтаФорма.Отчет.РежимОтбора = 2, 0, ЭтаФорма.Отчет.РежимОтбора);		
	КонецЕсли;
	
	Если ВариантОтчета = "Сводный" Тогда
		Отчет.Клиент 								= "";
		Отчет.ВидДоговораДоверительногоУправления 	= "";
		Отчет.СчетДоверительногоУправления 			= "";		
	КонецЕсли;
		
	ЭтаФорма.Заголовок = СтрШаблон("%1 (%2)",
		РеквизитФормыВЗначение("Отчет").Метаданные().Синоним,
		РаботаСОтчетамиКлиентСервер.ПолучитьПредставлениеВариантаОтчета(Отчет));

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период.Дата" + ?(Лев(ТекстСообщения, 9) = "Окончание" , "Окончания", "Начала"), Отказ); 	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)
	
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= Отчет.Период.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= Отчет.Период.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		Отчет.Период.ДатаНачала		= ДиалогВыбораПериода.Период.ДатаНачала;
		Отчет.Период.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
		
		ПриИзмененииПараметровОтчета(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ОрганизацияПараметрПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
	ЭтаФорма.Подписант = "";	
	ПодписантПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура НакопительныйИтогПриИзменении(Элемент)
	
	Если Отчет.НакопительныйИтог Тогда 
		Отчет.Период.ДатаНачала = НачалоГода(Отчет.Период.ДатаНачала);
	КонецЕсли;
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Отчет.Подписант));
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = Неопределено;	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ЮрФизЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(ВыбранноеЗначение, Отчет.Организация);
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("РегистрСведенийКлючЗаписи.КонтактныеЛица") Тогда
		СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);
	КонецЕсли;	
		
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьСтруктуруДанныхКонтактногоЛица(СтруктураДанныхКонтактногоЛица) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано некорректное значение!");
		ВыбранноеЗначение = Неопределено;
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;
	Отчет.Подписант = СтруктураДанныхКонтактногоЛица;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	Если Не ЗначениеЗаполнено(ЭтаФорма.Подписант) Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
		Отчет.Подписант = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьВсеДоговорыСУстановленнымПроцентомРасходовПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_процедуры_и_функции

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииПараметровОтчета(ЭтаФорма)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
		
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтаФорма.Отчет);	
	
	Элементы = ЭтаФорма.Элементы;	
	
	ОтчетыСНакопительнымИтогом = Новый Массив;
	ОтчетыСНакопительнымИтогом.Добавить("САФМАР");
	ОтчетыСНакопительнымИтогом.Добавить("Основной");
	ОтчетыСНакопительнымИтогом.Добавить("СРОиЦК");
	
	Элементы.НакопительныйИтог.Видимость = (ОтчетыСНакопительнымИтогом.Найти(ВариантОтчета) <> Неопределено);	
	
	ДоступныРазличныеРежимыОтбора = Не (ВариантОтчета = "Сводный" Или ВариантОтчета = "ПоКлиентуИВидуДоговораВЦелом");
	Элементы.РежимОтбора.Видимость = ДоступныРазличныеРежимыОтбора;
	
	Элементы.ВыводитьВсеДоговорыСУстановленнымПроцентомРасходов.Видимость = ВариантОтчета = "Сводный";
	
	Элементы.СчетДоверительногоУправления.Видимость = ДоступныРазличныеРежимыОтбора И ЭтаФорма.Отчет.РежимОтбора = 0;	
	Элементы.ГруппаКлиент.Видимость 				= ВариантОтчета <> "Сводный" И ЭтаФорма.Отчет.РежимОтбора >= 1;
	Элементы.Клиент.Видимость 						= ВариантОтчета <> "Сводный" И ЭтаФорма.Отчет.РежимОтбора = 1;
	Элементы.Подписант.Видимость					= ВариантОтчета <> "Сводный" И ВариантОтчета <> "НачисленныеИОплаченныеРасходы";

КонецПроцедуры      

#КонецОбласти
